<a href="https://colab.research.google.com/github/sungjindo/python_study/blob/main/ch7_%EB%8F%84%EC%84%B1%EC%A7%84.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**이름: 도성진**

## 1 DataFrame을 활용해 남성과 여성 각각 Age가 30이상인 사람들의 평균 Height을 구해보자.

In [ ]:
import pandas as pd
dataframe = pd.DataFrame({"Age" : [37, 20, 30, 45, 25, 31, 41],
                           "Height": [156, 180, 170, 160, 150, 140, 181],
                           "Sex": ["f", "m", "m", "f", "f", "f", "m"]
                           })

In [ ]:
print("남성 평균 키,", dataframe[(dataframe['Age'] >= 30) & (dataframe["Sex"] == "m")]['Height'].mean())
#175.5가 나와야함

남성 평균 키, 175.5

In [ ]:
print("여성 평균 키,", dataframe[(dataframe['Age'] >= 30) & (dataframe["Sex"] == "f")]['Height'].mean())

여성 평균 키, 152.0

## 2. 프로듀스 회사의 근무자, 성별, 근무지, 연봉이 기록된 “Produce.xlsx”에서 다음과 같은 질문에 답해보도록 하자!

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [ ]:
data_frame = pd.read_excel("/content/drive/My Drive/data/data/Produce.xlsx", sheet_name="Sheet1")
print(data_frame)

        이름 성별     근무지  연봉(만원)
0     강다니엘  M   SEOUL    5419
1      강동호  M  CICAGO    6443
2      강미나  F   SEOUL     445
3      권현빈  M      LA    1199
4      김도연  F  CICAGO    7579
5     김사무엘  M   SEOUL     290
6      김세정  F  CICAGO    4113
7      김소혜  F   SEOUL    1200
8      김청하  F   SEOUL    5447
9      노태현  M  CICAGO    3126
10    라이관린  M      LA    6890
11     박우진  M      LA    2371
12     박지훈  M   SEOUL    7980
13     배진영  M  CICAGO    8399
14     옹성우  M   SEOUL    2477
15     유연정  F   SEOUL    8474
16     임나영  F   SEOUL    6732
17     전소미  F      LA    9828
18     정채연  F   SEOUL    2208
19     주결경  F   SEOUL    7373
20     주학년  M  CICAGO    1379
21     최유정  F      LA    7137
22  타카다 켄타  M      LA    4091
23     하성운  M  CICAGO    8721

### # 1) 이름이 김사랑, 성별 F, 근무지 CICAGO, 연봉 6000인 직원을 추가하라

In [ ]:
row = pd.Series(['김사랑', 'F', 'CICAGO', 6000], index=['이름','성별','근무지','연봉(만원)'])
data_frame = data_frame.append(row, ignore_index=True)
print(data_frame)

        이름 성별     근무지  연봉(만원)
0     강다니엘  M   SEOUL    5419
1      강동호  M  CICAGO    6443
2      강미나  F   SEOUL     445
3      권현빈  M      LA    1199
4      김도연  F  CICAGO    7579
5     김사무엘  M   SEOUL     290
6      김세정  F  CICAGO    4113
7      김소혜  F   SEOUL    1200
8      김청하  F   SEOUL    5447
9      노태현  M  CICAGO    3126
10    라이관린  M      LA    6890
11     박우진  M      LA    2371
12     박지훈  M   SEOUL    7980
13     배진영  M  CICAGO    8399
14     옹성우  M   SEOUL    2477
15     유연정  F   SEOUL    8474
16     임나영  F   SEOUL    6732
17     전소미  F      LA    9828
18     정채연  F   SEOUL    2208
19     주결경  F   SEOUL    7373
20     주학년  M  CICAGO    1379
21     최유정  F      LA    7137
22  타카다 켄타  M      LA    4091
23     하성운  M  CICAGO    8721
24     김사랑  F  CICAGO    6000

### 2) 성별이 M이면 1, 성별이 F이면 0인 Sex 열을 추가하고, 성별 열을 제거하라.

In [ ]:
data_frame['Sex']=data_frame['성별'].replace(['M','F'], [1,0]) 
data_frame.drop('성별', axis=1)

        이름     근무지  연봉(만원)  Sex
0     강다니엘   SEOUL    5419    1
1      강동호  CICAGO    6443    1
2      강미나   SEOUL     445    0
3      권현빈      LA    1199    1
4      김도연  CICAGO    7579    0
5     김사무엘   SEOUL     290    1
6      김세정  CICAGO    4113    0
7      김소혜   SEOUL    1200    0
8      김청하   SEOUL    5447    0
9      노태현  CICAGO    3126    1
10    라이관린      LA    6890    1
11     박우진      LA    2371    1
12     박지훈   SEOUL    7980    1
13     배진영  CICAGO    8399    1
14     옹성우   SEOUL    2477    1
15     유연정   SEOUL    8474    0
16     임나영   SEOUL    6732    0
17     전소미      LA    9828    0
18     정채연   SEOUL    2208    0
19     주결경   SEOUL    7373    0
20     주학년  CICAGO    1379    1
21     최유정      LA    7137    0
22  타카다 켄타      LA    4091    1
23     하성운  CICAGO    8721    1
24     김사랑  CICAGO    6000    0

### 3) 근무지별, 성별 평균 연봉을 구하라.

In [ ]:
print("조건별 평균 연봉")
print("LA: %.2f" %(data_frame["연봉(만원)"][data_frame['근무지'] == 'LA'].mean()))
print("SEOUL: %.2f" %(data_frame["연봉(만원)"][data_frame['근무지'] =='SEOUL'].mean()))
print("CICAGO: %.2f" %(data_frame["연봉(만원)"][data_frame['근무지'] == 'CICAGO'].mean()))
print("남자: %.2f" %(data_frame["연봉(만원)"][data_frame['Sex'] == 1].mean()))
print("여자: %.2f" %(data_frame["연봉(만원)"][data_frame['Sex'] == 0].mean()))

조건별 평균 연봉
LA: 5252.67
SEOUL: 4367.73
CICAGO: 5720.00
남자: 4521.92
여자: 5544.67

### 4) 성별이 M이고 SEOUL에서 일하는 사람들의 평균 연봉을 구하라.

In [ ]:
data_frame["연봉(만원)"][(data_frame['Sex']==1) & (data_frame['근무지']=='SEOUL')].mean()
#답 4041.5

4041.5

### 5) 연봉이 5000이상인 사람들 중 여성의 비율을 구하여라.

In [ ]:
len(data_frame[(data_frame["연봉(만원)"] >= 5000) & (data_frame['Sex']==0)]) /  len(data_frame[data_frame['연봉(만원)'] >= 5000])
    #0.5714285714

0.5714285714285714